/*
Напишіть код, який працює так:
1. При завантажені сторінки в ul з id="post-list" виводиться список постів
з кнопкою з текстм delete поряд з кожним постом. 
2. Коли користувач заповнює форму, робиться POST запит на адресу
https://67e3b7b52ae442db76d13e6a.mockapi.io/api/posts і якщо добре - повертається новий пост,
який треба додати в список.
3. При натискані на кнопку з текстом delete робиться DELETE-запит на адресу
https://67e3b7b52ae442db76d13e6a.mockapi.io/api/posts/:id для видаленя поста.
*/