/*
Напишіть код заповнення табеля: запитуєш у користувача запис у форматі рядка, 
де оцінка та предмет розділені двокрапкою та пробілом, наприклад "Математика: 10".
Розділяєш строку на предмет на оцінку та записуєш в об'єкт tabel. Далі запитуєш знову,
поки користувач не натисне Cancel. Треба врахувати такі помилки:
1. Користувач розділив оцінку та предмет не ":" або забув ввести оцінку (тобто ввів: "Математика - 10").
2. Користувач випадково написав ще одне ":" (Наприклад: "Фізика: 12: Алгерба: 10").
3. Оцінка буде меньше за 0.
І вивести помилку користувачу.
*/