/*
Напишіть список покупок із формою додавання списку покупок.
Зліва у вас має бути блок із формою додавання нової покупки з такими полями:
- Назва;
- кількість;
- ціна;
- термінова покупка (чек-бокс);
- тип покупки (список, що випадає, з такими варіантами: побутова хімія, продукти, інше);

Справа у вас має бути список доданих покупок. Над списком
Необхідно виводити загальну кількість покупок та його ціну.
При натисканні на кожний пункт його можна перечернути - тобто він вже куплений
(Тоді його кількість і ціна забираються зі списку). При повторному натисканні він
повертається до списку.

Розмітку можете вивести за допомогою JS або одразу написати в index.html-файлі.
*/