/*
Напишіть логику роботи зі списком фільмів для залогіненного користувача.
Як це має працювати:
1. Якщо  localStorage немає поля "auth:token", то виводити на екран форму логіну.
2. Якщо токен є - робити запит на адресу https://eshop-a0nb.onrender.com/api/auth/current,
прикріпивши токен до запиту в заголовку Authorization: Bearer. Якщо токен у відповіді буде валідним, то показуєте 
зверху справа кнопку "Logout", а також інтерфейс роботи з фільмами.
Якщо у відповідь прийде 401 помилка, показуйте форму логіну.

Форма логіну - зовнішній вигляд так логіку треба взяти з попередньої задачі.

Інтерфейс роботи з фільмами:
1. Зліва має бути форма додавання фільму, яка включає в себе такі поля:
- title - назва фільму, обов'язкове;
- director - режисер фільму, обов'язкове;
- favorite - чи є фільм улюбленим, чекбокс, необов'язкове;
- type - до якого типу відноситься фільм. Список типів можна отримати, 
зробивши GET запит на адресу https://eshop-a0nb.onrender.com/api/movies/types.
Випадаючий список, обов'язкове;
- releaseYear - рік виходу фільму, число, обов'язкове;
Для додавання фільму зробіть POST запит на адресу https://eshop-a0nb.onrender.com/api/movies,
прикріпивши до запиту открім тіла ще ї токен.
2. Справа має бути список фільмів. Його можно отримати, зробивши GET-запит на адресу https://eshop-a0nb.onrender.com/api/movies,
прикріпивши до запиту  токен. При успішному додаванні фільму на бекенд він має з'являтися у цьому списку.
3. В списку фільмів поряд з кожним фільмом має бути кнопка Delete, при натискані на яку відбувається
DELETE запит на видалення фільму на адресу https://eshop-a0nb.onrender.com/api/movies/:id. 
У випадку успішного видалення фільму з бекенду він видаляється на сторінці.
*/